export default {
	'use-gpio-slider-label': 'GPIO 핀 사용',
	'gpio-input-mode-label': 'GPIO 입력 모드 선택',
	'gpio-input-mode-explanation': '<p>여러 프로필을 사용하지 않는 경우 <0>설정 페이지</0>의 부팅 입력 모드 옵션으로 충분할 것입니다.</p><p>이 화면에서는 컨트롤러를 연결할 때 GP2040-CE의 입력 모드로 진입하기 위해 누르고 있어야 할 물리적 버튼(GPIO 핀)을 설정할 수 있습니다（프로필 변경 시 바뀔 수 있는 매핑된 버튼과는 다릅니다）.</p><p>각 입력 모드에 대해 시작 시 불러올 프로필을 선택할 수도 있습니다（선택 사항）.</p>',
	'alert-text': '핀을 선택할 때는 🎮 버튼을 사용하는 것을 권장합니다. 연결되지 않았거나 사용할 수 없는 핀을 매핑하면 장치가 정상적으로 작동하지 않을 수 있습니다. 잘못된 설정을 초기화하려면 <0>설정 초기화</0> 페이지로 이동하세요.',
	'unique-validation-err': '매핑된 GPIO 핀은 중복될 수 없습니다',
	'required-validation-err': '필수 항목이 누락되었습니다',
	'generic-save-err': '변경 사항 저장에 실패했습니다',
}
