export default {
	'use-gpio-slider-label': 'GPIOピンを使用する',
	'gpio-input-mode-label': 'GPIO入力モード選択',
	'gpio-input-mode-explanation': '<p>複数のプロファイルを使用しない場合は、<0>設定ページ</0>のブート入力モードオプションで十分な場合がほとんどです。</p><p>この画面では、コントローラーを接続する際にGP2040-CEの各入力モードに入るために押し続ける物理ボタン（GPIOピン）を設定できます（プロファイル変更時に変わる可能性のあるマップされたボタンとは異なります）。</p><p>各入力モードに対して、起動時に読み込むプロファイルを任意で選択することもできます。</p>',
	'alert-text': '🎮ボタンを使用してピンを選択することをお勧めします。未接続または利用できないピンをマッピングすると、デバイスが正常に動作しなくなる可能性があります。無効な設定をクリアするには、<0>設定リセット</0>ページをご利用ください。',
	'unique-validation-err': 'マップされたGPIOピンに重複は使用できません',
	'required-validation-err': '必須フィールドが入力されていません',
	'generic-save-err': '変更の保存に失敗しました',

}
