export default {
	'header-text': 'カスタムLEDテーマ',
	'sub-header-text':
		'ここではカスタムLEDテーマの設定と有効化が可能です。<br />カスタムテーマはコントローラのアニメーションショートカットで選択できます。',
	'list-text':
		'<1>通常と押下時の色選択をクリックして選択します。</1> <1>コントローラーのバックグラウンドをクリックすることで色選択をキャンセルできます。</1> <1>対象ボタンの押下時色を確認するには対象ボタンを右クリックしてください。</1>',
	'led-layout-label': 'レイアウトを確認',
	'color-picker-location': 'カラーピッカーの位置',
	'has-custom-theme-label': '有効',
	'modal-title': 'カスタムテーマ削除確認',
	'modal-body': 'カスタムテーマの設定を削除します。よろしいですか？',
	'modal-no': 'いいえ',
	'modal-yes': 'はい',
};
